I've observed this behavior as well. 

```hcl
resource "azurerm_resource_group" "example" {
  name     = "exampleResourceGroup"
  location = "West Europe"
}

resource "azurerm_virtual_network" "example" {
  name                = "exampleVirtualNetwork"
  location            = azurerm_resource_group.example.location
  resource_group_name = azurerm_resource_group.example.name
  address_space       = ["10.0.0.0/16"]
  dns_servers         = ["10.200.0.4"] 
}

```

1) Initial `terraform apply` (with `dns_servers` set)

```
  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = [
          + "10.200.0.4",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = "exampleVirtualNetwork"
      + resource_group_name   = "exampleResourceGroup"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }
```

DNS server(s) are properly configured:

![image](https://user-images.githubusercontent.com/17407022/129338951-841cfe06-0dd7-46e9-b421-b0493eaba70f.png)


Commenting `dns_servers` out:

```hcl
resource "azurerm_virtual_network" "example" {
  name                = "exampleVirtualNetwork"
  location            = azurerm_resource_group.example.location
  resource_group_name = azurerm_resource_group.example.name
  address_space       = ["10.0.0.0/16"]
#  dns_servers         = ["10.200.0.4"] 
}
```

Running a second `terraform plan`

```console
No changes. Your infrastructure matches the configuration.
```

Running `terraform apply -auto-approve` does also not show any changes, nor does it update the config. The DNS server(s) are still configured. The only way to solved that in TF is to set `dns_servers` to `[]`:

```hcl
resource "azurerm_virtual_network" "example" {
  name                = "exampleVirtualNetwork"
  location            = azurerm_resource_group.example.location
  resource_group_name = azurerm_resource_group.example.name
  address_space       = ["10.0.0.0/16"]
  dns_servers         = [] 
}
```
This makes TF to revert the `dns_servers` back to "default".

```console
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_virtual_network.example will be updated in-place
  ~ resource "azurerm_virtual_network" "example" {
      ~ dns_servers           = [
          - "10.200.0.4",
        ]
        id                    = "/subscriptions/../exampleVirtualNetwork"
        name                  = "exampleVirtualNetwork"
        tags                  = {}
        # (6 unchanged attributes hidden)
    }
```

![image](https://user-images.githubusercontent.com/17407022/129339565-32ec39a4-d657-4cbf-b5b0-58722ad57f25.png)
